notes_api/app/controllers/api/v1/notes_controller.rb

SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC
---
  def index
    @notes = Note.all.order(created_at: :desc)

INSERT INTO "notes" ("title", "content", "created_at", "updated_at") VALUES ('hello', 'say hello', '2025-06-17 17:44:46.820560', '2025-06-17 17:44:46.820560') RETURNING "id"
---
  def create
    @note = Note.new(note_params)

    if @note.save